###################################################################

# Created by write_sdc on Tue Jul 15 07:38:12 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name Small -library                                       \
sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c
set_load -pin_load 0.05 [get_ports val_valid]
set_load -pin_load 0.05 [get_ports {val[31]}]
set_load -pin_load 0.05 [get_ports {val[30]}]
set_load -pin_load 0.05 [get_ports {val[29]}]
set_load -pin_load 0.05 [get_ports {val[28]}]
set_load -pin_load 0.05 [get_ports {val[27]}]
set_load -pin_load 0.05 [get_ports {val[26]}]
set_load -pin_load 0.05 [get_ports {val[25]}]
set_load -pin_load 0.05 [get_ports {val[24]}]
set_load -pin_load 0.05 [get_ports {val[23]}]
set_load -pin_load 0.05 [get_ports {val[22]}]
set_load -pin_load 0.05 [get_ports {val[21]}]
set_load -pin_load 0.05 [get_ports {val[20]}]
set_load -pin_load 0.05 [get_ports {val[19]}]
set_load -pin_load 0.05 [get_ports {val[18]}]
set_load -pin_load 0.05 [get_ports {val[17]}]
set_load -pin_load 0.05 [get_ports {val[16]}]
set_load -pin_load 0.05 [get_ports {val[15]}]
set_load -pin_load 0.05 [get_ports {val[14]}]
set_load -pin_load 0.05 [get_ports {val[13]}]
set_load -pin_load 0.05 [get_ports {val[12]}]
set_load -pin_load 0.05 [get_ports {val[11]}]
set_load -pin_load 0.05 [get_ports {val[10]}]
set_load -pin_load 0.05 [get_ports {val[9]}]
set_load -pin_load 0.05 [get_ports {val[8]}]
set_load -pin_load 0.05 [get_ports {val[7]}]
set_load -pin_load 0.05 [get_ports {val[6]}]
set_load -pin_load 0.05 [get_ports {val[5]}]
set_load -pin_load 0.05 [get_ports {val[4]}]
set_load -pin_load 0.05 [get_ports {val[3]}]
set_load -pin_load 0.05 [get_ports {val[2]}]
set_load -pin_load 0.05 [get_ports {val[1]}]
set_load -pin_load 0.05 [get_ports {val[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports r1_valid]
set_max_capacitance 0.15 [get_ports r2_valid]
set_max_capacitance 0.15 [get_ports {r1[63]}]
set_max_capacitance 0.15 [get_ports {r1[62]}]
set_max_capacitance 0.15 [get_ports {r1[61]}]
set_max_capacitance 0.15 [get_ports {r1[60]}]
set_max_capacitance 0.15 [get_ports {r1[59]}]
set_max_capacitance 0.15 [get_ports {r1[58]}]
set_max_capacitance 0.15 [get_ports {r1[57]}]
set_max_capacitance 0.15 [get_ports {r1[56]}]
set_max_capacitance 0.15 [get_ports {r1[55]}]
set_max_capacitance 0.15 [get_ports {r1[54]}]
set_max_capacitance 0.15 [get_ports {r1[53]}]
set_max_capacitance 0.15 [get_ports {r1[52]}]
set_max_capacitance 0.15 [get_ports {r1[51]}]
set_max_capacitance 0.15 [get_ports {r1[50]}]
set_max_capacitance 0.15 [get_ports {r1[49]}]
set_max_capacitance 0.15 [get_ports {r1[48]}]
set_max_capacitance 0.15 [get_ports {r1[47]}]
set_max_capacitance 0.15 [get_ports {r1[46]}]
set_max_capacitance 0.15 [get_ports {r1[45]}]
set_max_capacitance 0.15 [get_ports {r1[44]}]
set_max_capacitance 0.15 [get_ports {r1[43]}]
set_max_capacitance 0.15 [get_ports {r1[42]}]
set_max_capacitance 0.15 [get_ports {r1[41]}]
set_max_capacitance 0.15 [get_ports {r1[40]}]
set_max_capacitance 0.15 [get_ports {r1[39]}]
set_max_capacitance 0.15 [get_ports {r1[38]}]
set_max_capacitance 0.15 [get_ports {r1[37]}]
set_max_capacitance 0.15 [get_ports {r1[36]}]
set_max_capacitance 0.15 [get_ports {r1[35]}]
set_max_capacitance 0.15 [get_ports {r1[34]}]
set_max_capacitance 0.15 [get_ports {r1[33]}]
set_max_capacitance 0.15 [get_ports {r1[32]}]
set_max_capacitance 0.15 [get_ports {r1[31]}]
set_max_capacitance 0.15 [get_ports {r1[30]}]
set_max_capacitance 0.15 [get_ports {r1[29]}]
set_max_capacitance 0.15 [get_ports {r1[28]}]
set_max_capacitance 0.15 [get_ports {r1[27]}]
set_max_capacitance 0.15 [get_ports {r1[26]}]
set_max_capacitance 0.15 [get_ports {r1[25]}]
set_max_capacitance 0.15 [get_ports {r1[24]}]
set_max_capacitance 0.15 [get_ports {r1[23]}]
set_max_capacitance 0.15 [get_ports {r1[22]}]
set_max_capacitance 0.15 [get_ports {r1[21]}]
set_max_capacitance 0.15 [get_ports {r1[20]}]
set_max_capacitance 0.15 [get_ports {r1[19]}]
set_max_capacitance 0.15 [get_ports {r1[18]}]
set_max_capacitance 0.15 [get_ports {r1[17]}]
set_max_capacitance 0.15 [get_ports {r1[16]}]
set_max_capacitance 0.15 [get_ports {r1[15]}]
set_max_capacitance 0.15 [get_ports {r1[14]}]
set_max_capacitance 0.15 [get_ports {r1[13]}]
set_max_capacitance 0.15 [get_ports {r1[12]}]
set_max_capacitance 0.15 [get_ports {r1[11]}]
set_max_capacitance 0.15 [get_ports {r1[10]}]
set_max_capacitance 0.15 [get_ports {r1[9]}]
set_max_capacitance 0.15 [get_ports {r1[8]}]
set_max_capacitance 0.15 [get_ports {r1[7]}]
set_max_capacitance 0.15 [get_ports {r1[6]}]
set_max_capacitance 0.15 [get_ports {r1[5]}]
set_max_capacitance 0.15 [get_ports {r1[4]}]
set_max_capacitance 0.15 [get_ports {r1[3]}]
set_max_capacitance 0.15 [get_ports {r1[2]}]
set_max_capacitance 0.15 [get_ports {r1[1]}]
set_max_capacitance 0.15 [get_ports {r1[0]}]
set_max_capacitance 0.15 [get_ports {r2[63]}]
set_max_capacitance 0.15 [get_ports {r2[62]}]
set_max_capacitance 0.15 [get_ports {r2[61]}]
set_max_capacitance 0.15 [get_ports {r2[60]}]
set_max_capacitance 0.15 [get_ports {r2[59]}]
set_max_capacitance 0.15 [get_ports {r2[58]}]
set_max_capacitance 0.15 [get_ports {r2[57]}]
set_max_capacitance 0.15 [get_ports {r2[56]}]
set_max_capacitance 0.15 [get_ports {r2[55]}]
set_max_capacitance 0.15 [get_ports {r2[54]}]
set_max_capacitance 0.15 [get_ports {r2[53]}]
set_max_capacitance 0.15 [get_ports {r2[52]}]
set_max_capacitance 0.15 [get_ports {r2[51]}]
set_max_capacitance 0.15 [get_ports {r2[50]}]
set_max_capacitance 0.15 [get_ports {r2[49]}]
set_max_capacitance 0.15 [get_ports {r2[48]}]
set_max_capacitance 0.15 [get_ports {r2[47]}]
set_max_capacitance 0.15 [get_ports {r2[46]}]
set_max_capacitance 0.15 [get_ports {r2[45]}]
set_max_capacitance 0.15 [get_ports {r2[44]}]
set_max_capacitance 0.15 [get_ports {r2[43]}]
set_max_capacitance 0.15 [get_ports {r2[42]}]
set_max_capacitance 0.15 [get_ports {r2[41]}]
set_max_capacitance 0.15 [get_ports {r2[40]}]
set_max_capacitance 0.15 [get_ports {r2[39]}]
set_max_capacitance 0.15 [get_ports {r2[38]}]
set_max_capacitance 0.15 [get_ports {r2[37]}]
set_max_capacitance 0.15 [get_ports {r2[36]}]
set_max_capacitance 0.15 [get_ports {r2[35]}]
set_max_capacitance 0.15 [get_ports {r2[34]}]
set_max_capacitance 0.15 [get_ports {r2[33]}]
set_max_capacitance 0.15 [get_ports {r2[32]}]
set_max_capacitance 0.15 [get_ports {r2[31]}]
set_max_capacitance 0.15 [get_ports {r2[30]}]
set_max_capacitance 0.15 [get_ports {r2[29]}]
set_max_capacitance 0.15 [get_ports {r2[28]}]
set_max_capacitance 0.15 [get_ports {r2[27]}]
set_max_capacitance 0.15 [get_ports {r2[26]}]
set_max_capacitance 0.15 [get_ports {r2[25]}]
set_max_capacitance 0.15 [get_ports {r2[24]}]
set_max_capacitance 0.15 [get_ports {r2[23]}]
set_max_capacitance 0.15 [get_ports {r2[22]}]
set_max_capacitance 0.15 [get_ports {r2[21]}]
set_max_capacitance 0.15 [get_ports {r2[20]}]
set_max_capacitance 0.15 [get_ports {r2[19]}]
set_max_capacitance 0.15 [get_ports {r2[18]}]
set_max_capacitance 0.15 [get_ports {r2[17]}]
set_max_capacitance 0.15 [get_ports {r2[16]}]
set_max_capacitance 0.15 [get_ports {r2[15]}]
set_max_capacitance 0.15 [get_ports {r2[14]}]
set_max_capacitance 0.15 [get_ports {r2[13]}]
set_max_capacitance 0.15 [get_ports {r2[12]}]
set_max_capacitance 0.15 [get_ports {r2[11]}]
set_max_capacitance 0.15 [get_ports {r2[10]}]
set_max_capacitance 0.15 [get_ports {r2[9]}]
set_max_capacitance 0.15 [get_ports {r2[8]}]
set_max_capacitance 0.15 [get_ports {r2[7]}]
set_max_capacitance 0.15 [get_ports {r2[6]}]
set_max_capacitance 0.15 [get_ports {r2[5]}]
set_max_capacitance 0.15 [get_ports {r2[4]}]
set_max_capacitance 0.15 [get_ports {r2[3]}]
set_max_capacitance 0.15 [get_ports {r2[2]}]
set_max_capacitance 0.15 [get_ports {r2[1]}]
set_max_capacitance 0.15 [get_ports {r2[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports r1_valid]
set_max_fanout 10 [get_ports r2_valid]
set_max_fanout 10 [get_ports {r1[63]}]
set_max_fanout 10 [get_ports {r1[62]}]
set_max_fanout 10 [get_ports {r1[61]}]
set_max_fanout 10 [get_ports {r1[60]}]
set_max_fanout 10 [get_ports {r1[59]}]
set_max_fanout 10 [get_ports {r1[58]}]
set_max_fanout 10 [get_ports {r1[57]}]
set_max_fanout 10 [get_ports {r1[56]}]
set_max_fanout 10 [get_ports {r1[55]}]
set_max_fanout 10 [get_ports {r1[54]}]
set_max_fanout 10 [get_ports {r1[53]}]
set_max_fanout 10 [get_ports {r1[52]}]
set_max_fanout 10 [get_ports {r1[51]}]
set_max_fanout 10 [get_ports {r1[50]}]
set_max_fanout 10 [get_ports {r1[49]}]
set_max_fanout 10 [get_ports {r1[48]}]
set_max_fanout 10 [get_ports {r1[47]}]
set_max_fanout 10 [get_ports {r1[46]}]
set_max_fanout 10 [get_ports {r1[45]}]
set_max_fanout 10 [get_ports {r1[44]}]
set_max_fanout 10 [get_ports {r1[43]}]
set_max_fanout 10 [get_ports {r1[42]}]
set_max_fanout 10 [get_ports {r1[41]}]
set_max_fanout 10 [get_ports {r1[40]}]
set_max_fanout 10 [get_ports {r1[39]}]
set_max_fanout 10 [get_ports {r1[38]}]
set_max_fanout 10 [get_ports {r1[37]}]
set_max_fanout 10 [get_ports {r1[36]}]
set_max_fanout 10 [get_ports {r1[35]}]
set_max_fanout 10 [get_ports {r1[34]}]
set_max_fanout 10 [get_ports {r1[33]}]
set_max_fanout 10 [get_ports {r1[32]}]
set_max_fanout 10 [get_ports {r1[31]}]
set_max_fanout 10 [get_ports {r1[30]}]
set_max_fanout 10 [get_ports {r1[29]}]
set_max_fanout 10 [get_ports {r1[28]}]
set_max_fanout 10 [get_ports {r1[27]}]
set_max_fanout 10 [get_ports {r1[26]}]
set_max_fanout 10 [get_ports {r1[25]}]
set_max_fanout 10 [get_ports {r1[24]}]
set_max_fanout 10 [get_ports {r1[23]}]
set_max_fanout 10 [get_ports {r1[22]}]
set_max_fanout 10 [get_ports {r1[21]}]
set_max_fanout 10 [get_ports {r1[20]}]
set_max_fanout 10 [get_ports {r1[19]}]
set_max_fanout 10 [get_ports {r1[18]}]
set_max_fanout 10 [get_ports {r1[17]}]
set_max_fanout 10 [get_ports {r1[16]}]
set_max_fanout 10 [get_ports {r1[15]}]
set_max_fanout 10 [get_ports {r1[14]}]
set_max_fanout 10 [get_ports {r1[13]}]
set_max_fanout 10 [get_ports {r1[12]}]
set_max_fanout 10 [get_ports {r1[11]}]
set_max_fanout 10 [get_ports {r1[10]}]
set_max_fanout 10 [get_ports {r1[9]}]
set_max_fanout 10 [get_ports {r1[8]}]
set_max_fanout 10 [get_ports {r1[7]}]
set_max_fanout 10 [get_ports {r1[6]}]
set_max_fanout 10 [get_ports {r1[5]}]
set_max_fanout 10 [get_ports {r1[4]}]
set_max_fanout 10 [get_ports {r1[3]}]
set_max_fanout 10 [get_ports {r1[2]}]
set_max_fanout 10 [get_ports {r1[1]}]
set_max_fanout 10 [get_ports {r1[0]}]
set_max_fanout 10 [get_ports {r2[63]}]
set_max_fanout 10 [get_ports {r2[62]}]
set_max_fanout 10 [get_ports {r2[61]}]
set_max_fanout 10 [get_ports {r2[60]}]
set_max_fanout 10 [get_ports {r2[59]}]
set_max_fanout 10 [get_ports {r2[58]}]
set_max_fanout 10 [get_ports {r2[57]}]
set_max_fanout 10 [get_ports {r2[56]}]
set_max_fanout 10 [get_ports {r2[55]}]
set_max_fanout 10 [get_ports {r2[54]}]
set_max_fanout 10 [get_ports {r2[53]}]
set_max_fanout 10 [get_ports {r2[52]}]
set_max_fanout 10 [get_ports {r2[51]}]
set_max_fanout 10 [get_ports {r2[50]}]
set_max_fanout 10 [get_ports {r2[49]}]
set_max_fanout 10 [get_ports {r2[48]}]
set_max_fanout 10 [get_ports {r2[47]}]
set_max_fanout 10 [get_ports {r2[46]}]
set_max_fanout 10 [get_ports {r2[45]}]
set_max_fanout 10 [get_ports {r2[44]}]
set_max_fanout 10 [get_ports {r2[43]}]
set_max_fanout 10 [get_ports {r2[42]}]
set_max_fanout 10 [get_ports {r2[41]}]
set_max_fanout 10 [get_ports {r2[40]}]
set_max_fanout 10 [get_ports {r2[39]}]
set_max_fanout 10 [get_ports {r2[38]}]
set_max_fanout 10 [get_ports {r2[37]}]
set_max_fanout 10 [get_ports {r2[36]}]
set_max_fanout 10 [get_ports {r2[35]}]
set_max_fanout 10 [get_ports {r2[34]}]
set_max_fanout 10 [get_ports {r2[33]}]
set_max_fanout 10 [get_ports {r2[32]}]
set_max_fanout 10 [get_ports {r2[31]}]
set_max_fanout 10 [get_ports {r2[30]}]
set_max_fanout 10 [get_ports {r2[29]}]
set_max_fanout 10 [get_ports {r2[28]}]
set_max_fanout 10 [get_ports {r2[27]}]
set_max_fanout 10 [get_ports {r2[26]}]
set_max_fanout 10 [get_ports {r2[25]}]
set_max_fanout 10 [get_ports {r2[24]}]
set_max_fanout 10 [get_ports {r2[23]}]
set_max_fanout 10 [get_ports {r2[22]}]
set_max_fanout 10 [get_ports {r2[21]}]
set_max_fanout 10 [get_ports {r2[20]}]
set_max_fanout 10 [get_ports {r2[19]}]
set_max_fanout 10 [get_ports {r2[18]}]
set_max_fanout 10 [get_ports {r2[17]}]
set_max_fanout 10 [get_ports {r2[16]}]
set_max_fanout 10 [get_ports {r2[15]}]
set_max_fanout 10 [get_ports {r2[14]}]
set_max_fanout 10 [get_ports {r2[13]}]
set_max_fanout 10 [get_ports {r2[12]}]
set_max_fanout 10 [get_ports {r2[11]}]
set_max_fanout 10 [get_ports {r2[10]}]
set_max_fanout 10 [get_ports {r2[9]}]
set_max_fanout 10 [get_ports {r2[8]}]
set_max_fanout 10 [get_ports {r2[7]}]
set_max_fanout 10 [get_ports {r2[6]}]
set_max_fanout 10 [get_ports {r2[5]}]
set_max_fanout 10 [get_ports {r2[4]}]
set_max_fanout 10 [get_ports {r2[3]}]
set_max_fanout 10 [get_ports {r2[2]}]
set_max_fanout 10 [get_ports {r2[1]}]
set_max_fanout 10 [get_ports {r2[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports r1_valid]
set_max_transition 3 [get_ports r2_valid]
set_max_transition 3 [get_ports {r1[63]}]
set_max_transition 3 [get_ports {r1[62]}]
set_max_transition 3 [get_ports {r1[61]}]
set_max_transition 3 [get_ports {r1[60]}]
set_max_transition 3 [get_ports {r1[59]}]
set_max_transition 3 [get_ports {r1[58]}]
set_max_transition 3 [get_ports {r1[57]}]
set_max_transition 3 [get_ports {r1[56]}]
set_max_transition 3 [get_ports {r1[55]}]
set_max_transition 3 [get_ports {r1[54]}]
set_max_transition 3 [get_ports {r1[53]}]
set_max_transition 3 [get_ports {r1[52]}]
set_max_transition 3 [get_ports {r1[51]}]
set_max_transition 3 [get_ports {r1[50]}]
set_max_transition 3 [get_ports {r1[49]}]
set_max_transition 3 [get_ports {r1[48]}]
set_max_transition 3 [get_ports {r1[47]}]
set_max_transition 3 [get_ports {r1[46]}]
set_max_transition 3 [get_ports {r1[45]}]
set_max_transition 3 [get_ports {r1[44]}]
set_max_transition 3 [get_ports {r1[43]}]
set_max_transition 3 [get_ports {r1[42]}]
set_max_transition 3 [get_ports {r1[41]}]
set_max_transition 3 [get_ports {r1[40]}]
set_max_transition 3 [get_ports {r1[39]}]
set_max_transition 3 [get_ports {r1[38]}]
set_max_transition 3 [get_ports {r1[37]}]
set_max_transition 3 [get_ports {r1[36]}]
set_max_transition 3 [get_ports {r1[35]}]
set_max_transition 3 [get_ports {r1[34]}]
set_max_transition 3 [get_ports {r1[33]}]
set_max_transition 3 [get_ports {r1[32]}]
set_max_transition 3 [get_ports {r1[31]}]
set_max_transition 3 [get_ports {r1[30]}]
set_max_transition 3 [get_ports {r1[29]}]
set_max_transition 3 [get_ports {r1[28]}]
set_max_transition 3 [get_ports {r1[27]}]
set_max_transition 3 [get_ports {r1[26]}]
set_max_transition 3 [get_ports {r1[25]}]
set_max_transition 3 [get_ports {r1[24]}]
set_max_transition 3 [get_ports {r1[23]}]
set_max_transition 3 [get_ports {r1[22]}]
set_max_transition 3 [get_ports {r1[21]}]
set_max_transition 3 [get_ports {r1[20]}]
set_max_transition 3 [get_ports {r1[19]}]
set_max_transition 3 [get_ports {r1[18]}]
set_max_transition 3 [get_ports {r1[17]}]
set_max_transition 3 [get_ports {r1[16]}]
set_max_transition 3 [get_ports {r1[15]}]
set_max_transition 3 [get_ports {r1[14]}]
set_max_transition 3 [get_ports {r1[13]}]
set_max_transition 3 [get_ports {r1[12]}]
set_max_transition 3 [get_ports {r1[11]}]
set_max_transition 3 [get_ports {r1[10]}]
set_max_transition 3 [get_ports {r1[9]}]
set_max_transition 3 [get_ports {r1[8]}]
set_max_transition 3 [get_ports {r1[7]}]
set_max_transition 3 [get_ports {r1[6]}]
set_max_transition 3 [get_ports {r1[5]}]
set_max_transition 3 [get_ports {r1[4]}]
set_max_transition 3 [get_ports {r1[3]}]
set_max_transition 3 [get_ports {r1[2]}]
set_max_transition 3 [get_ports {r1[1]}]
set_max_transition 3 [get_ports {r1[0]}]
set_max_transition 3 [get_ports {r2[63]}]
set_max_transition 3 [get_ports {r2[62]}]
set_max_transition 3 [get_ports {r2[61]}]
set_max_transition 3 [get_ports {r2[60]}]
set_max_transition 3 [get_ports {r2[59]}]
set_max_transition 3 [get_ports {r2[58]}]
set_max_transition 3 [get_ports {r2[57]}]
set_max_transition 3 [get_ports {r2[56]}]
set_max_transition 3 [get_ports {r2[55]}]
set_max_transition 3 [get_ports {r2[54]}]
set_max_transition 3 [get_ports {r2[53]}]
set_max_transition 3 [get_ports {r2[52]}]
set_max_transition 3 [get_ports {r2[51]}]
set_max_transition 3 [get_ports {r2[50]}]
set_max_transition 3 [get_ports {r2[49]}]
set_max_transition 3 [get_ports {r2[48]}]
set_max_transition 3 [get_ports {r2[47]}]
set_max_transition 3 [get_ports {r2[46]}]
set_max_transition 3 [get_ports {r2[45]}]
set_max_transition 3 [get_ports {r2[44]}]
set_max_transition 3 [get_ports {r2[43]}]
set_max_transition 3 [get_ports {r2[42]}]
set_max_transition 3 [get_ports {r2[41]}]
set_max_transition 3 [get_ports {r2[40]}]
set_max_transition 3 [get_ports {r2[39]}]
set_max_transition 3 [get_ports {r2[38]}]
set_max_transition 3 [get_ports {r2[37]}]
set_max_transition 3 [get_ports {r2[36]}]
set_max_transition 3 [get_ports {r2[35]}]
set_max_transition 3 [get_ports {r2[34]}]
set_max_transition 3 [get_ports {r2[33]}]
set_max_transition 3 [get_ports {r2[32]}]
set_max_transition 3 [get_ports {r2[31]}]
set_max_transition 3 [get_ports {r2[30]}]
set_max_transition 3 [get_ports {r2[29]}]
set_max_transition 3 [get_ports {r2[28]}]
set_max_transition 3 [get_ports {r2[27]}]
set_max_transition 3 [get_ports {r2[26]}]
set_max_transition 3 [get_ports {r2[25]}]
set_max_transition 3 [get_ports {r2[24]}]
set_max_transition 3 [get_ports {r2[23]}]
set_max_transition 3 [get_ports {r2[22]}]
set_max_transition 3 [get_ports {r2[21]}]
set_max_transition 3 [get_ports {r2[20]}]
set_max_transition 3 [get_ports {r2[19]}]
set_max_transition 3 [get_ports {r2[18]}]
set_max_transition 3 [get_ports {r2[17]}]
set_max_transition 3 [get_ports {r2[16]}]
set_max_transition 3 [get_ports {r2[15]}]
set_max_transition 3 [get_ports {r2[14]}]
set_max_transition 3 [get_ports {r2[13]}]
set_max_transition 3 [get_ports {r2[12]}]
set_max_transition 3 [get_ports {r2[11]}]
set_max_transition 3 [get_ports {r2[10]}]
set_max_transition 3 [get_ports {r2[9]}]
set_max_transition 3 [get_ports {r2[8]}]
set_max_transition 3 [get_ports {r2[7]}]
set_max_transition 3 [get_ports {r2[6]}]
set_max_transition 3 [get_ports {r2[5]}]
set_max_transition 3 [get_ports {r2[4]}]
set_max_transition 3 [get_ports {r2[3]}]
set_max_transition 3 [get_ports {r2[2]}]
set_max_transition 3 [get_ports {r2[1]}]
set_max_transition 3 [get_ports {r2[0]}]
create_clock [get_ports clk]  -period 1.7  -waveform {0 0.85}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 0.85  [get_ports r1_valid]
set_input_delay -clock clk  -min 0  [get_ports r1_valid]
set_input_delay -clock clk  -max 0.85  [get_ports r2_valid]
set_input_delay -clock clk  -min 0  [get_ports r2_valid]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[63]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[63]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[62]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[62]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[61]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[61]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[60]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[60]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[59]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[59]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[58]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[58]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[57]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[57]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[56]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[56]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[55]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[55]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[54]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[54]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[53]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[53]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[52]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[52]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[51]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[51]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[50]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[50]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[49]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[49]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[48]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[48]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[47]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[47]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[46]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[46]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[45]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[45]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[44]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[44]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[43]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[43]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[42]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[42]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[41]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[41]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[40]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[40]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[39]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[39]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[38]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[38]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[37]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[37]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[36]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[36]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[35]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[35]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[34]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[34]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[33]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[33]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[32]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[32]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[31]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[31]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[30]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[30]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[29]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[29]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[28]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[28]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[27]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[27]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[26]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[26]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[25]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[25]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[24]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[24]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[23]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[23]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[22]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[22]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[21]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[21]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[20]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[20]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[19]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[19]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[18]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[18]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[17]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[17]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[16]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[16]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[15]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[15]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[14]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[14]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[13]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[13]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[12]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[12]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[11]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[11]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[10]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[10]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[9]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[9]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[8]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[8]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[7]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[7]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[6]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[6]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[5]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[5]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[4]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[4]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[3]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[3]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[2]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[2]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[1]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[1]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r1[0]}]
set_input_delay -clock clk  -min 0  [get_ports {r1[0]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[63]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[63]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[62]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[62]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[61]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[61]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[60]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[60]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[59]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[59]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[58]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[58]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[57]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[57]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[56]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[56]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[55]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[55]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[54]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[54]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[53]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[53]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[52]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[52]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[51]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[51]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[50]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[50]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[49]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[49]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[48]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[48]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[47]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[47]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[46]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[46]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[45]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[45]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[44]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[44]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[43]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[43]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[42]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[42]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[41]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[41]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[40]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[40]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[39]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[39]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[38]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[38]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[37]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[37]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[36]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[36]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[35]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[35]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[34]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[34]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[33]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[33]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[32]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[32]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[31]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[31]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[30]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[30]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[29]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[29]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[28]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[28]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[27]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[27]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[26]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[26]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[25]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[25]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[24]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[24]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[23]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[23]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[22]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[22]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[21]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[21]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[20]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[20]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[19]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[19]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[18]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[18]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[17]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[17]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[16]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[16]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[15]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[15]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[14]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[14]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[13]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[13]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[12]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[12]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[11]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[11]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[10]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[10]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[9]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[9]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[8]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[8]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[7]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[7]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[6]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[6]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[5]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[5]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[4]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[4]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[3]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[3]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[2]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[2]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[1]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[1]}]
set_input_delay -clock clk  -max 0.85  [get_ports {r2[0]}]
set_input_delay -clock clk  -min 0  [get_ports {r2[0]}]
set_output_delay -clock clk  -max 0.85  [get_ports val_valid]
set_output_delay -clock clk  -min 0  [get_ports val_valid]
set_output_delay -clock clk  -max 0.85  [get_ports {val[31]}]
set_output_delay -clock clk  -min 0  [get_ports {val[31]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[30]}]
set_output_delay -clock clk  -min 0  [get_ports {val[30]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[29]}]
set_output_delay -clock clk  -min 0  [get_ports {val[29]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[28]}]
set_output_delay -clock clk  -min 0  [get_ports {val[28]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[27]}]
set_output_delay -clock clk  -min 0  [get_ports {val[27]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[26]}]
set_output_delay -clock clk  -min 0  [get_ports {val[26]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[25]}]
set_output_delay -clock clk  -min 0  [get_ports {val[25]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[24]}]
set_output_delay -clock clk  -min 0  [get_ports {val[24]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[23]}]
set_output_delay -clock clk  -min 0  [get_ports {val[23]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[22]}]
set_output_delay -clock clk  -min 0  [get_ports {val[22]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[21]}]
set_output_delay -clock clk  -min 0  [get_ports {val[21]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[20]}]
set_output_delay -clock clk  -min 0  [get_ports {val[20]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[19]}]
set_output_delay -clock clk  -min 0  [get_ports {val[19]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[18]}]
set_output_delay -clock clk  -min 0  [get_ports {val[18]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[17]}]
set_output_delay -clock clk  -min 0  [get_ports {val[17]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[16]}]
set_output_delay -clock clk  -min 0  [get_ports {val[16]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[15]}]
set_output_delay -clock clk  -min 0  [get_ports {val[15]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[14]}]
set_output_delay -clock clk  -min 0  [get_ports {val[14]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[13]}]
set_output_delay -clock clk  -min 0  [get_ports {val[13]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[12]}]
set_output_delay -clock clk  -min 0  [get_ports {val[12]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[11]}]
set_output_delay -clock clk  -min 0  [get_ports {val[11]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[10]}]
set_output_delay -clock clk  -min 0  [get_ports {val[10]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[9]}]
set_output_delay -clock clk  -min 0  [get_ports {val[9]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[8]}]
set_output_delay -clock clk  -min 0  [get_ports {val[8]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[7]}]
set_output_delay -clock clk  -min 0  [get_ports {val[7]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[6]}]
set_output_delay -clock clk  -min 0  [get_ports {val[6]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[5]}]
set_output_delay -clock clk  -min 0  [get_ports {val[5]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[4]}]
set_output_delay -clock clk  -min 0  [get_ports {val[4]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[3]}]
set_output_delay -clock clk  -min 0  [get_ports {val[3]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[2]}]
set_output_delay -clock clk  -min 0  [get_ports {val[2]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[1]}]
set_output_delay -clock clk  -min 0  [get_ports {val[1]}]
set_output_delay -clock clk  -max 0.85  [get_ports {val[0]}]
set_output_delay -clock clk  -min 0  [get_ports {val[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports r1_valid]
set_input_transition -min 0.5  [get_ports r1_valid]
set_input_transition -max 0.5  [get_ports r2_valid]
set_input_transition -min 0.5  [get_ports r2_valid]
set_input_transition -max 0.5  [get_ports {r1[63]}]
set_input_transition -min 0.5  [get_ports {r1[63]}]
set_input_transition -max 0.5  [get_ports {r1[62]}]
set_input_transition -min 0.5  [get_ports {r1[62]}]
set_input_transition -max 0.5  [get_ports {r1[61]}]
set_input_transition -min 0.5  [get_ports {r1[61]}]
set_input_transition -max 0.5  [get_ports {r1[60]}]
set_input_transition -min 0.5  [get_ports {r1[60]}]
set_input_transition -max 0.5  [get_ports {r1[59]}]
set_input_transition -min 0.5  [get_ports {r1[59]}]
set_input_transition -max 0.5  [get_ports {r1[58]}]
set_input_transition -min 0.5  [get_ports {r1[58]}]
set_input_transition -max 0.5  [get_ports {r1[57]}]
set_input_transition -min 0.5  [get_ports {r1[57]}]
set_input_transition -max 0.5  [get_ports {r1[56]}]
set_input_transition -min 0.5  [get_ports {r1[56]}]
set_input_transition -max 0.5  [get_ports {r1[55]}]
set_input_transition -min 0.5  [get_ports {r1[55]}]
set_input_transition -max 0.5  [get_ports {r1[54]}]
set_input_transition -min 0.5  [get_ports {r1[54]}]
set_input_transition -max 0.5  [get_ports {r1[53]}]
set_input_transition -min 0.5  [get_ports {r1[53]}]
set_input_transition -max 0.5  [get_ports {r1[52]}]
set_input_transition -min 0.5  [get_ports {r1[52]}]
set_input_transition -max 0.5  [get_ports {r1[51]}]
set_input_transition -min 0.5  [get_ports {r1[51]}]
set_input_transition -max 0.5  [get_ports {r1[50]}]
set_input_transition -min 0.5  [get_ports {r1[50]}]
set_input_transition -max 0.5  [get_ports {r1[49]}]
set_input_transition -min 0.5  [get_ports {r1[49]}]
set_input_transition -max 0.5  [get_ports {r1[48]}]
set_input_transition -min 0.5  [get_ports {r1[48]}]
set_input_transition -max 0.5  [get_ports {r1[47]}]
set_input_transition -min 0.5  [get_ports {r1[47]}]
set_input_transition -max 0.5  [get_ports {r1[46]}]
set_input_transition -min 0.5  [get_ports {r1[46]}]
set_input_transition -max 0.5  [get_ports {r1[45]}]
set_input_transition -min 0.5  [get_ports {r1[45]}]
set_input_transition -max 0.5  [get_ports {r1[44]}]
set_input_transition -min 0.5  [get_ports {r1[44]}]
set_input_transition -max 0.5  [get_ports {r1[43]}]
set_input_transition -min 0.5  [get_ports {r1[43]}]
set_input_transition -max 0.5  [get_ports {r1[42]}]
set_input_transition -min 0.5  [get_ports {r1[42]}]
set_input_transition -max 0.5  [get_ports {r1[41]}]
set_input_transition -min 0.5  [get_ports {r1[41]}]
set_input_transition -max 0.5  [get_ports {r1[40]}]
set_input_transition -min 0.5  [get_ports {r1[40]}]
set_input_transition -max 0.5  [get_ports {r1[39]}]
set_input_transition -min 0.5  [get_ports {r1[39]}]
set_input_transition -max 0.5  [get_ports {r1[38]}]
set_input_transition -min 0.5  [get_ports {r1[38]}]
set_input_transition -max 0.5  [get_ports {r1[37]}]
set_input_transition -min 0.5  [get_ports {r1[37]}]
set_input_transition -max 0.5  [get_ports {r1[36]}]
set_input_transition -min 0.5  [get_ports {r1[36]}]
set_input_transition -max 0.5  [get_ports {r1[35]}]
set_input_transition -min 0.5  [get_ports {r1[35]}]
set_input_transition -max 0.5  [get_ports {r1[34]}]
set_input_transition -min 0.5  [get_ports {r1[34]}]
set_input_transition -max 0.5  [get_ports {r1[33]}]
set_input_transition -min 0.5  [get_ports {r1[33]}]
set_input_transition -max 0.5  [get_ports {r1[32]}]
set_input_transition -min 0.5  [get_ports {r1[32]}]
set_input_transition -max 0.5  [get_ports {r1[31]}]
set_input_transition -min 0.5  [get_ports {r1[31]}]
set_input_transition -max 0.5  [get_ports {r1[30]}]
set_input_transition -min 0.5  [get_ports {r1[30]}]
set_input_transition -max 0.5  [get_ports {r1[29]}]
set_input_transition -min 0.5  [get_ports {r1[29]}]
set_input_transition -max 0.5  [get_ports {r1[28]}]
set_input_transition -min 0.5  [get_ports {r1[28]}]
set_input_transition -max 0.5  [get_ports {r1[27]}]
set_input_transition -min 0.5  [get_ports {r1[27]}]
set_input_transition -max 0.5  [get_ports {r1[26]}]
set_input_transition -min 0.5  [get_ports {r1[26]}]
set_input_transition -max 0.5  [get_ports {r1[25]}]
set_input_transition -min 0.5  [get_ports {r1[25]}]
set_input_transition -max 0.5  [get_ports {r1[24]}]
set_input_transition -min 0.5  [get_ports {r1[24]}]
set_input_transition -max 0.5  [get_ports {r1[23]}]
set_input_transition -min 0.5  [get_ports {r1[23]}]
set_input_transition -max 0.5  [get_ports {r1[22]}]
set_input_transition -min 0.5  [get_ports {r1[22]}]
set_input_transition -max 0.5  [get_ports {r1[21]}]
set_input_transition -min 0.5  [get_ports {r1[21]}]
set_input_transition -max 0.5  [get_ports {r1[20]}]
set_input_transition -min 0.5  [get_ports {r1[20]}]
set_input_transition -max 0.5  [get_ports {r1[19]}]
set_input_transition -min 0.5  [get_ports {r1[19]}]
set_input_transition -max 0.5  [get_ports {r1[18]}]
set_input_transition -min 0.5  [get_ports {r1[18]}]
set_input_transition -max 0.5  [get_ports {r1[17]}]
set_input_transition -min 0.5  [get_ports {r1[17]}]
set_input_transition -max 0.5  [get_ports {r1[16]}]
set_input_transition -min 0.5  [get_ports {r1[16]}]
set_input_transition -max 0.5  [get_ports {r1[15]}]
set_input_transition -min 0.5  [get_ports {r1[15]}]
set_input_transition -max 0.5  [get_ports {r1[14]}]
set_input_transition -min 0.5  [get_ports {r1[14]}]
set_input_transition -max 0.5  [get_ports {r1[13]}]
set_input_transition -min 0.5  [get_ports {r1[13]}]
set_input_transition -max 0.5  [get_ports {r1[12]}]
set_input_transition -min 0.5  [get_ports {r1[12]}]
set_input_transition -max 0.5  [get_ports {r1[11]}]
set_input_transition -min 0.5  [get_ports {r1[11]}]
set_input_transition -max 0.5  [get_ports {r1[10]}]
set_input_transition -min 0.5  [get_ports {r1[10]}]
set_input_transition -max 0.5  [get_ports {r1[9]}]
set_input_transition -min 0.5  [get_ports {r1[9]}]
set_input_transition -max 0.5  [get_ports {r1[8]}]
set_input_transition -min 0.5  [get_ports {r1[8]}]
set_input_transition -max 0.5  [get_ports {r1[7]}]
set_input_transition -min 0.5  [get_ports {r1[7]}]
set_input_transition -max 0.5  [get_ports {r1[6]}]
set_input_transition -min 0.5  [get_ports {r1[6]}]
set_input_transition -max 0.5  [get_ports {r1[5]}]
set_input_transition -min 0.5  [get_ports {r1[5]}]
set_input_transition -max 0.5  [get_ports {r1[4]}]
set_input_transition -min 0.5  [get_ports {r1[4]}]
set_input_transition -max 0.5  [get_ports {r1[3]}]
set_input_transition -min 0.5  [get_ports {r1[3]}]
set_input_transition -max 0.5  [get_ports {r1[2]}]
set_input_transition -min 0.5  [get_ports {r1[2]}]
set_input_transition -max 0.5  [get_ports {r1[1]}]
set_input_transition -min 0.5  [get_ports {r1[1]}]
set_input_transition -max 0.5  [get_ports {r1[0]}]
set_input_transition -min 0.5  [get_ports {r1[0]}]
set_input_transition -max 0.5  [get_ports {r2[63]}]
set_input_transition -min 0.5  [get_ports {r2[63]}]
set_input_transition -max 0.5  [get_ports {r2[62]}]
set_input_transition -min 0.5  [get_ports {r2[62]}]
set_input_transition -max 0.5  [get_ports {r2[61]}]
set_input_transition -min 0.5  [get_ports {r2[61]}]
set_input_transition -max 0.5  [get_ports {r2[60]}]
set_input_transition -min 0.5  [get_ports {r2[60]}]
set_input_transition -max 0.5  [get_ports {r2[59]}]
set_input_transition -min 0.5  [get_ports {r2[59]}]
set_input_transition -max 0.5  [get_ports {r2[58]}]
set_input_transition -min 0.5  [get_ports {r2[58]}]
set_input_transition -max 0.5  [get_ports {r2[57]}]
set_input_transition -min 0.5  [get_ports {r2[57]}]
set_input_transition -max 0.5  [get_ports {r2[56]}]
set_input_transition -min 0.5  [get_ports {r2[56]}]
set_input_transition -max 0.5  [get_ports {r2[55]}]
set_input_transition -min 0.5  [get_ports {r2[55]}]
set_input_transition -max 0.5  [get_ports {r2[54]}]
set_input_transition -min 0.5  [get_ports {r2[54]}]
set_input_transition -max 0.5  [get_ports {r2[53]}]
set_input_transition -min 0.5  [get_ports {r2[53]}]
set_input_transition -max 0.5  [get_ports {r2[52]}]
set_input_transition -min 0.5  [get_ports {r2[52]}]
set_input_transition -max 0.5  [get_ports {r2[51]}]
set_input_transition -min 0.5  [get_ports {r2[51]}]
set_input_transition -max 0.5  [get_ports {r2[50]}]
set_input_transition -min 0.5  [get_ports {r2[50]}]
set_input_transition -max 0.5  [get_ports {r2[49]}]
set_input_transition -min 0.5  [get_ports {r2[49]}]
set_input_transition -max 0.5  [get_ports {r2[48]}]
set_input_transition -min 0.5  [get_ports {r2[48]}]
set_input_transition -max 0.5  [get_ports {r2[47]}]
set_input_transition -min 0.5  [get_ports {r2[47]}]
set_input_transition -max 0.5  [get_ports {r2[46]}]
set_input_transition -min 0.5  [get_ports {r2[46]}]
set_input_transition -max 0.5  [get_ports {r2[45]}]
set_input_transition -min 0.5  [get_ports {r2[45]}]
set_input_transition -max 0.5  [get_ports {r2[44]}]
set_input_transition -min 0.5  [get_ports {r2[44]}]
set_input_transition -max 0.5  [get_ports {r2[43]}]
set_input_transition -min 0.5  [get_ports {r2[43]}]
set_input_transition -max 0.5  [get_ports {r2[42]}]
set_input_transition -min 0.5  [get_ports {r2[42]}]
set_input_transition -max 0.5  [get_ports {r2[41]}]
set_input_transition -min 0.5  [get_ports {r2[41]}]
set_input_transition -max 0.5  [get_ports {r2[40]}]
set_input_transition -min 0.5  [get_ports {r2[40]}]
set_input_transition -max 0.5  [get_ports {r2[39]}]
set_input_transition -min 0.5  [get_ports {r2[39]}]
set_input_transition -max 0.5  [get_ports {r2[38]}]
set_input_transition -min 0.5  [get_ports {r2[38]}]
set_input_transition -max 0.5  [get_ports {r2[37]}]
set_input_transition -min 0.5  [get_ports {r2[37]}]
set_input_transition -max 0.5  [get_ports {r2[36]}]
set_input_transition -min 0.5  [get_ports {r2[36]}]
set_input_transition -max 0.5  [get_ports {r2[35]}]
set_input_transition -min 0.5  [get_ports {r2[35]}]
set_input_transition -max 0.5  [get_ports {r2[34]}]
set_input_transition -min 0.5  [get_ports {r2[34]}]
set_input_transition -max 0.5  [get_ports {r2[33]}]
set_input_transition -min 0.5  [get_ports {r2[33]}]
set_input_transition -max 0.5  [get_ports {r2[32]}]
set_input_transition -min 0.5  [get_ports {r2[32]}]
set_input_transition -max 0.5  [get_ports {r2[31]}]
set_input_transition -min 0.5  [get_ports {r2[31]}]
set_input_transition -max 0.5  [get_ports {r2[30]}]
set_input_transition -min 0.5  [get_ports {r2[30]}]
set_input_transition -max 0.5  [get_ports {r2[29]}]
set_input_transition -min 0.5  [get_ports {r2[29]}]
set_input_transition -max 0.5  [get_ports {r2[28]}]
set_input_transition -min 0.5  [get_ports {r2[28]}]
set_input_transition -max 0.5  [get_ports {r2[27]}]
set_input_transition -min 0.5  [get_ports {r2[27]}]
set_input_transition -max 0.5  [get_ports {r2[26]}]
set_input_transition -min 0.5  [get_ports {r2[26]}]
set_input_transition -max 0.5  [get_ports {r2[25]}]
set_input_transition -min 0.5  [get_ports {r2[25]}]
set_input_transition -max 0.5  [get_ports {r2[24]}]
set_input_transition -min 0.5  [get_ports {r2[24]}]
set_input_transition -max 0.5  [get_ports {r2[23]}]
set_input_transition -min 0.5  [get_ports {r2[23]}]
set_input_transition -max 0.5  [get_ports {r2[22]}]
set_input_transition -min 0.5  [get_ports {r2[22]}]
set_input_transition -max 0.5  [get_ports {r2[21]}]
set_input_transition -min 0.5  [get_ports {r2[21]}]
set_input_transition -max 0.5  [get_ports {r2[20]}]
set_input_transition -min 0.5  [get_ports {r2[20]}]
set_input_transition -max 0.5  [get_ports {r2[19]}]
set_input_transition -min 0.5  [get_ports {r2[19]}]
set_input_transition -max 0.5  [get_ports {r2[18]}]
set_input_transition -min 0.5  [get_ports {r2[18]}]
set_input_transition -max 0.5  [get_ports {r2[17]}]
set_input_transition -min 0.5  [get_ports {r2[17]}]
set_input_transition -max 0.5  [get_ports {r2[16]}]
set_input_transition -min 0.5  [get_ports {r2[16]}]
set_input_transition -max 0.5  [get_ports {r2[15]}]
set_input_transition -min 0.5  [get_ports {r2[15]}]
set_input_transition -max 0.5  [get_ports {r2[14]}]
set_input_transition -min 0.5  [get_ports {r2[14]}]
set_input_transition -max 0.5  [get_ports {r2[13]}]
set_input_transition -min 0.5  [get_ports {r2[13]}]
set_input_transition -max 0.5  [get_ports {r2[12]}]
set_input_transition -min 0.5  [get_ports {r2[12]}]
set_input_transition -max 0.5  [get_ports {r2[11]}]
set_input_transition -min 0.5  [get_ports {r2[11]}]
set_input_transition -max 0.5  [get_ports {r2[10]}]
set_input_transition -min 0.5  [get_ports {r2[10]}]
set_input_transition -max 0.5  [get_ports {r2[9]}]
set_input_transition -min 0.5  [get_ports {r2[9]}]
set_input_transition -max 0.5  [get_ports {r2[8]}]
set_input_transition -min 0.5  [get_ports {r2[8]}]
set_input_transition -max 0.5  [get_ports {r2[7]}]
set_input_transition -min 0.5  [get_ports {r2[7]}]
set_input_transition -max 0.5  [get_ports {r2[6]}]
set_input_transition -min 0.5  [get_ports {r2[6]}]
set_input_transition -max 0.5  [get_ports {r2[5]}]
set_input_transition -min 0.5  [get_ports {r2[5]}]
set_input_transition -max 0.5  [get_ports {r2[4]}]
set_input_transition -min 0.5  [get_ports {r2[4]}]
set_input_transition -max 0.5  [get_ports {r2[3]}]
set_input_transition -min 0.5  [get_ports {r2[3]}]
set_input_transition -max 0.5  [get_ports {r2[2]}]
set_input_transition -min 0.5  [get_ports {r2[2]}]
set_input_transition -max 0.5  [get_ports {r2[1]}]
set_input_transition -min 0.5  [get_ports {r2[1]}]
set_input_transition -max 0.5  [get_ports {r2[0]}]
set_input_transition -min 0.5  [get_ports {r2[0]}]
